[
  {
    "side": "right",
    "role": "Admin",
    "path": "admin",
    "glowColor": "#89CFF0",
    "description": [
      "Admins oversee the operational backbone of the system. They are responsible for managing user accounts, assigning roles, controlling permissions, and ensuring that each department functions within the proper access boundaries."
    ],
    "color": "linear-gradient(135deg, #667eea 0%, #764ba2 100%)",
    "size": 90
  },
  {
    "side": "right",
    "role": "Employee",
    "path": "employee",
    "glowColor": "#dbc1ac",
    "description": [
      "Employees are the core operational users of the system. They interact directly with assigned tasks, project activities, or day-to-day processes defined by their respective departments. Their interface is streamlined to enhance productivity and simplify routine workflows."
    ],
    "color": "linear-gradient(135deg, #f093fb 0%, #f5576c 100%)",
    "size": 50
  },
  {
    "side": "left",
    "role": "Manager",
    "path": "manager",
    "glowColor": "#C11C84",
    "description": [
      "Managers act as team leaders responsible for supervising employee activity, ensuring proper task distribution, monitoring performance, and guiding workflow execution. They play a strategic role in maintaining both productivity and team morale."
    ],
    "color": "linear-gradient(135deg, #4facfe 0%, #00f2fe 100%)",
    "size": 84
  },
  {
    "side": "left",
    "role": "HR",
    "path": "hr",
    "glowColor": "#FFBF00",
    "description": [
      "HR personnel manage the human side of the platform — employee records, organizational structure, compliance policies, and routine employee interactions."
    ],
    "color": "linear-gradient(135deg, #43e97b 0%, #38f9d7 100%)",
    "size": 60
  },
  {
    "side": "left",
    "role": "Guest",
    "path": "guest",
    "glowColor": "#B0D8C4",
    "description": [
      "Guests have restricted, read-only visibility across selected areas of the system. This role is primarily intended for demonstrations, evaluations, or temporary access where no changes are allowed. Guests can explore the interface, preview workflows, and understand how the platform operates without interacting with sensitive data."
    ],
    "color": "linear-gradient(135deg, #fa709a 0%, #fee140 100%)",
    "size": 76
  },
  {
    "side": "right",
    "role": "Superuser",
    "path": "superuser",
    "glowColor": "#BF40BF",
    "description": [
      "The Superuser holds the highest level of authority within the platform, functioning as the ultimate system controller. This role bypasses most permission restrictions and is responsible for managing deep-level configurations that affect the entire ecosystem."
    ],
    "color": "linear-gradient(135deg, #30cfd0 0%, #330867 100%)",
    "size": 72
  }
]
